[
    {
        "id": "Open-RAN-Co-Op",
        "title": "Open6G OTIC Website",
        "role": "Open RAN Website Design and Automation Co-Op for the Institute for the Wireless Internet of Things (WIoT), a hub for developing and testing next-generation wireless networks based on Open RAN",
        "timeline": "July 2024 - December 2024",
        "overview": [
            "Designed a public-facing website showcasing the company’s mission, services, achievements, etc. to expand customer reach and strengthen credibility",
            "Built a portal featuring customer and administrative views to provide a unified interface which tracks and manages the results, documentation, and resources of tests performed on customer assets",
            "Drove the end-to-end development process of user research, branding, UI design, user testing (with companies such as NVIDIA, Keysight Technologies, and Rakuten), coding, and deployment for the website and portal"
        ],
        "tags": [
            "Full-Stack Web Development",
            "React",
            "TypeScript",
            "Node.js",
            "Express.js",
            "HTML",
            "CSS",
            "AWS",
            "MySQL",
            "LDAP",
            "Postman",
            "UI/UX Design",
            "User Research",
            "Identity and Brand Design",
            "Visual/Graphic Design",
            "Figma",
            "FigJam"
        ],
        "video": "new-otic.mp4",
        "image": "open6g.png",
        "link": "https://www.open6g.us",
        "link-description": " the public-facing website I developed. Featured below is the basic workflow within the private client and administrative portals I developed for the MVP.",
        "summary": "During my co-op at the Institute for the Wireless Internet of Things (WIoT), I designed a public-facing website showcasing the company’s mission, services, achievements, etc. to expand customer reach and strengthen credibility. Additionally, I built a portal featuring customer and administrative views to provide a unified interface which tracks and manages the results, documentation, and resources of tests performed on customer assets. For the website and portal, I drove the end-to-end development process of user research, branding, UI design, user testing (with companies such as NVIDIA, Keysight Technologies, and Rakuten), coding, and deployment.",
        "subtitles": [  
        ],
        "images": [
        ],
        "descriptions": [
        ]
    },
    {
        "id": "Bullet-Journal-GUI",
        "title": "Bullet Journal GUI",
        "role": "Student in Object-Oriented Design Course at Northeastern University",
        "timeline": "June 2023",
        "overview": [
            "Collaborated with a team of 2 other students to build a GUI that allows users to add daily events, tasks, notes, etc. to a weekly bullet journal-style calendar",
            "Programmed Model-View-Controller features that persist and render weekly data, bound daily event and task counts, and greet users with a splash screen"
        ],
        "tags": [
            "Graphical User Interface",
            "Object-Oriented Design",
            "Model-View-Controller",
            "Java",
            "JavaFX",
            "SceneBuilder",
            "UI/UX Design",
            "Visual/Graphic Design"
        ],
        "image": "gui.png",
        "link": "https://github.com/CS-3500-OOD/pa05-oodesigners.git",
        "link-description": " our GitHub repository.",
        "summary": "The final project for my Object-Oriented Design course was to make a bullet journal GUI using Java, JavaFX, and GitHub. My group presented our work to a TA and earned extra credit for adding a splash screen and other styled elements.",
        "subtitles": [
            "UML Diagram",
            "Main Screen",
            "Splash Screen"
        ],
        "images": [
            "/adalia-lee/media/b-uml.png",
            "/adalia-lee/media/b-screen.jpg",
            "/adalia-lee/media/b-splash.jpg"
        ],
        "descriptions": [
            "I learned how to make UML diagrams in OOD, which is a super helpful skill. I like that it helps me visualize the different parts of the code and how they relate to each other. Color-coding the sections can be fun, too!",
            "Users are able to create new tasks and events, as well as set and update maximums for them. They can also customize and save week names, quotes, notes, and more. A list of of the week's tasks appear on the side and there's a gif of a journal and pencil at the top right corner. My team used the real-time code-editing feature in IntelliJ to collaborate. We set up the code structure and data types together, then branched off from there. Other than that, I primarily implemented the saving and error handling of tasks and events, splash screen, gif, and led the design decisions/styling."        ]
    },
    {
        "id": "Cat-Productivity-App",
        "title": "Cat. Productivity App",
        "role": "Software Developer in Oasis Club at Northeastern University",
        "timeline": "January - August 2023",
        "overview": [
            "Collaborated with a team of 3 other students to develop an app that promotes productivity with the incentive of caring for a virtual cat, where simulated health levels shift based on user-provided data about task completion",
            "Designed front-end and back-end features such as adding to and keeping track of to-do list"
        ],
        "tags": [
            "App Development",
            "Swift",
            "UI/UX Design",
            "Visual/Graphic Design"
        ],
        "video": "cat.mp4",
        "image": "cats.png",
        "link": "https://docs.google.com/presentation/d/1diSObLUX2Z0oYTokTo0dHxVyEd29z666rwdQsvBWA0A/edit?usp=sharing",
        "link-description": " the slideshow we presented that contains the GitHub repository link, and you can view a video demo of our app below.",
        "summary": "Through joining the Oasis club on campus, I gained experience using Swift. For my whole team, it was our first time using Swift, so we got to learn together. Every Sunday, we had peer coding sessions and would ask our mentors questions.",
        "subtitles": [
        ],
        "images": [
        ],
        "descriptions": [
        ]
    },
    {
        "id": "Iron-Intake-Website",
        "title": "Iron Intake Website",
        "role": "Student in Experience and Interaction Course at Northeastern University",
        "timeline": "March 2023 - April 2023",
        "overview": [
            "Developed an educational website about how to increase iron intake, which identifies and addresses several target audience groups that are more likely to be iron-deficient",
            "Incorporated multiple website features, pages, interactive animations, and user customizations to increase user engagement"
        ],
        "tags": [
            "Web Development",
            "HTML",
            "CSS",
            "UI/UX Design",
            "User Research",
            "Visual/Graphic Design",
            "Health Research"
        ],
        "image": "home.png",
        "link": "https://www.figma.com/file/RRlWXRqHeg7Sh71OGkNHag/Iron-Intake-Website-Project-Documentation?type=design&node-id=401%3A180&mode=design&t=q9ao696v1g8v7CfX-1",
        "link-description": " my central Figma file for my detailed project documentation divided into pages for the concept statement, analysis for existing websites, content research, initial wireframes, revised wireframes, changes between iterations, and final website screenshots.",
        "summary": "For my Experience and Interaction course final project, I developed a website that gives educates users about how to increase their iron intake. It provides users with suggestions customized to their target group (those who are menstruating, pregnant, vegan, or curious.",
        "subtitles": [
            "Main Screens"
        ],
        "images": [
            "/adalia-lee/media/i-wireframes.png"
        ],
        "descriptions": [
        ]
    },
    {
        "id": "EcoKeen-Carbon-Footprint-Tracker-App",
        "title": "EcoKeen Carbon Footprint Tracker App",
        "role": "Student in Women in Tech Club at Cupertino High School",
        "timeline": "December 2020 - April 2021",
        "overview": [
            "Built a carbon footprint tracker application with a team of 4 other students to combat climate change in a more approachable manner",
            "Generated data visualizations of a user's carbon footprint based on their energy usage, and features a personalized recommendation system for tips/alternatives to reduce their carbon footprints"
        ],
        "tags": [
            "Thunkable",
            "UI/UX Design",
            "User Research",
            "Visual/Graphic Design",
            "Business"
        ],
        "image": "wit.png",
        "link": "https://docs.google.com/presentation/d/1zzpNN-4pmIu7RQ4gZA5-95nLF6b4-IymvYOAz1U6d6Y/edit?usp=sharing",
        "link-description": " the slideshow we presented to the Technovation judges. These are some screenshots from our Thunkable prototype.",
        "summary": "In high school, I joined our Women in Tech Club to participate in the Technovation Challenge with a team. This was one of my first exposures to programming, and it was nice exploring other areas such as business and design at the same time to produce a well-rounded project submission.",
        "subtitles": [
            "Main Screens"
        ],
        "images": [
            "/adalia-lee/media/wit.png"
        ],
        "descriptions": [
        ]
    }
]